GreatCowBASIC/DATFileGenerator/incfiles/p18F56Q84.inc
;----- DMANCON0 Bits -----------------------------------------------------
XIP              EQU  H'0000'
AIRQEN           EQU  H'0002'
DGO              EQU  H'0005'
SIRQEN           EQU  H'0006'
EN               EQU  H'0007'


;----- DMANCON1 Bits -----------------------------------------------------
SSTP             EQU  H'0000'
SMODE0           EQU  H'0001'
SMODE1           EQU  H'0002'
SMR0             EQU  H'0003'
SMR1             EQU  H'0004'
DSTP             EQU  H'0005'
DMODE0           EQU  H'0006'
DMODE1           EQU  H'0007'


;----- DMANAIRQ Bits -----------------------------------------------------
AIRQ0            EQU  H'0000'
AIRQ1            EQU  H'0001'
AIRQ2            EQU  H'0002'
AIRQ3            EQU  H'0003'
AIRQ4            EQU  H'0004'
AIRQ5            EQU  H'0005'
AIRQ6            EQU  H'0006'
AIRQ7            EQU  H'0007'


;----- DMANSIRQ Bits -----------------------------------------------------
SIRQ0            EQU  H'0000'
SIRQ1            EQU  H'0001'
SIRQ2            EQU  H'0002'
SIRQ3            EQU  H'0003'
SIRQ4            EQU  H'0004'
SIRQ5            EQU  H'0005'
SIRQ6            EQU  H'0006'
SIRQ7            EQU  H'0007'


;----- C1CONL Bits -----------------------------------------------------
DNCNT0           EQU  H'0000'
DNCNT1           EQU  H'0001'
DNCNT2           EQU  H'0002'
DNCNT3           EQU  H'0003'
DNCNT4           EQU  H'0004'
ISOCRCEN         EQU  H'0005'
PXEDIS           EQU  H'0006'
CLKSEL0          EQU  H'0007'
DNCNT0           EQU  H'0000'
DNCNT1           EQU  H'0001'
DNCNT2           EQU  H'0002'
DNCNT3           EQU  H'0003'
DNCNT4           EQU  H'0004'


;----- C1CONH Bits -----------------------------------------------------
WAKFIL           EQU  H'0000'
WFT0             EQU  H'0001'
WFT1             EQU  H'0002'
BUSY_C1CONH      EQU  H'0003'
BRSDIS           EQU  H'0004'
SIDL             EQU  H'0005'
FRZ              EQU  H'0006'
ON_C1CONH        EQU  H'0007'
WFT0             EQU  H'0001'
WFT1             EQU  H'0002'


;----- C1CONU Bits -----------------------------------------------------
RTXAT            EQU  H'0000'
ESIGM            EQU  H'0001'
SERR2LOM         EQU  H'0002'
STEF             EQU  H'0003'
TXQEN            EQU  H'0004'
OPMOD0           EQU  H'0005'
OPMOD1           EQU  H'0006'
OPMOD2           EQU  H'0007'
OPMOD0           EQU  H'0005'
OPMOD1           EQU  H'0006'
OPMOD2           EQU  H'0007'


;----- C1CONT Bits -----------------------------------------------------
REQOP0           EQU  H'0000'
REQOP1           EQU  H'0001'
REQOP2           EQU  H'0002'
ABAT             EQU  H'0003'
TXBWS0           EQU  H'0004'
TXBWS1           EQU  H'0005'
TXBWS2           EQU  H'0006'
TXBWS3           EQU  H'0007'
REQOP0           EQU  H'0000'
REQOP1           EQU  H'0001'
REQOP2           EQU  H'0002'
TXBWS0           EQU  H'0004'
TXBWS1           EQU  H'0005'
TXBWS2           EQU  H'0006'
TXBWS3           EQU  H'0007'


;----- C1NBTCFGL Bits -----------------------------------------------------
SJW0             EQU  H'0000'
SJW1             EQU  H'0001'
SJW2             EQU  H'0002'
SJW3             EQU  H'0003'
SJW4             EQU  H'0004'
SJW5             EQU  H'0005'
SJW6             EQU  H'0006'
SJW0             EQU  H'0000'
SJW1             EQU  H'0001'
SJW2             EQU  H'0002'
SJW3             EQU  H'0003'
SJW4             EQU  H'0004'
SJW5             EQU  H'0005'
SJW6             EQU  H'0006'


;----- C1NBTCFGH Bits -----------------------------------------------------
TSEG20           EQU  H'0000'
TSEG21           EQU  H'0001'
TSEG22           EQU  H'0002'
TSEG23           EQU  H'0003'
TSEG24           EQU  H'0004'
TSEG25           EQU  H'0005'
TSEG26           EQU  H'0006'
TSEG20           EQU  H'0000'
TSEG21           EQU  H'0001'
TSEG22           EQU  H'0002'
TSEG23           EQU  H'0003'
TSEG24           EQU  H'0004'
TSEG25           EQU  H'0005'
TSEG26           EQU  H'0006'


;----- C1NBTCFGU Bits -----------------------------------------------------
TSEG10           EQU  H'0000'
TSEG11           EQU  H'0001'
TSEG12           EQU  H'0002'
TSEG13           EQU  H'0003'
TSEG14           EQU  H'0004'
TSEG15           EQU  H'0005'
TSEG16           EQU  H'0006'
TSEG17           EQU  H'0007'


;----- C1NBTCFGT Bits -----------------------------------------------------
BRP0             EQU  H'0000'
BRP1             EQU  H'0001'
BRP2             EQU  H'0002'
BRP3             EQU  H'0003'
BRP4             EQU  H'0004'
BRP5             EQU  H'0005'
BRP6             EQU  H'0006'
BRP7             EQU  H'0007'


;----- C1DBTCFGL Bits -----------------------------------------------------
SJW0             EQU  H'0000'
SJW1             EQU  H'0001'
SJW2             EQU  H'0002'
SJW3             EQU  H'0003'
SJW0             EQU  H'0000'
SJW1             EQU  H'0001'
SJW2             EQU  H'0002'
SJW3             EQU  H'0003'


;----- C1DBTCFGH Bits -----------------------------------------------------
TSEG20           EQU  H'0000'
TSEG21           EQU  H'0001'
TSEG22           EQU  H'0002'
TSEG23           EQU  H'0003'
TSEG20           EQU  H'0000'
TSEG21           EQU  H'0001'
TSEG22           EQU  H'0002'
TSEG23           EQU  H'0003'


;----- C1DBTCFGU Bits -----------------------------------------------------
TSEG10           EQU  H'0000'
TSEG11           EQU  H'0001'
TSEG12           EQU  H'0002'
TSEG13           EQU  H'0003'
TSEG14           EQU  H'0004'
TSEG10           EQU  H'0000'
TSEG11           EQU  H'0001'
TSEG12           EQU  H'0002'
TSEG13           EQU  H'0003'
TSEG14           EQU  H'0004'


;----- C1DBTCFGT Bits -----------------------------------------------------
BRP0             EQU  H'0000'
BRP1             EQU  H'0001'
BRP2             EQU  H'0002'
BRP3             EQU  H'0003'
BRP4             EQU  H'0004'
BRP5             EQU  H'0005'
BRP6             EQU  H'0006'
BRP7             EQU  H'0007'


