GreatCowBASIC/DATFileGenerator/incfiles/p18F56Q84.inc
;----- C1TDCL Bits -----------------------------------------------------
TDCV0            EQU  H'0000'
TDCV1            EQU  H'0001'
TDCV2            EQU  H'0002'
TDCV3            EQU  H'0003'
TDCV4            EQU  H'0004'
TDCV5            EQU  H'0005'
TDCV0            EQU  H'0000'
TDCV1            EQU  H'0001'
TDCV2            EQU  H'0002'
TDCV3            EQU  H'0003'
TDCV4            EQU  H'0004'
TDCV5            EQU  H'0005'


;----- C1TDCH Bits -----------------------------------------------------
TDCO0            EQU  H'0000'
TDCO1            EQU  H'0001'
TDCO2            EQU  H'0002'
TDCO3            EQU  H'0003'
TDCO4            EQU  H'0004'
TDCO5            EQU  H'0005'
TDCO6            EQU  H'0006'
TDCO0            EQU  H'0000'
TDCO1            EQU  H'0001'
TDCO2            EQU  H'0002'
TDCO3            EQU  H'0003'
TDCO4            EQU  H'0004'
TDCO5            EQU  H'0005'
TDCO6            EQU  H'0006'


;----- C1TDCU Bits -----------------------------------------------------
TDCMOD0          EQU  H'0000'
TDCMOD1          EQU  H'0001'
TDCMOD0          EQU  H'0000'
TDCMOD1          EQU  H'0001'


;----- C1TDCT Bits -----------------------------------------------------
SID11EN          EQU  H'0000'
EDGFLTEN         EQU  H'0001'


;----- C1TBC Bits -----------------------------------------------------
TBC0             EQU  H'0000'
TBC1             EQU  H'0001'
TBC2             EQU  H'0002'
TBC3             EQU  H'0003'
TBC4             EQU  H'0004'
TBC5             EQU  H'0005'
TBC6             EQU  H'0006'
TBC7             EQU  H'0007'


;----- C1TBCH Bits -----------------------------------------------------
TBC8             EQU  H'0000'
TBC9             EQU  H'0001'
TBC10            EQU  H'0002'
TBC11            EQU  H'0003'
TBC12            EQU  H'0004'
TBC13            EQU  H'0005'
TBC14            EQU  H'0006'
TBC15            EQU  H'0007'


;----- C1TBCU Bits -----------------------------------------------------
TBC16            EQU  H'0000'
TBC17            EQU  H'0001'
TBC18            EQU  H'0002'
TBC19            EQU  H'0003'
TBC20            EQU  H'0004'
TBC21            EQU  H'0005'
TBC22            EQU  H'0006'
TBC23            EQU  H'0007'


;----- C1TBCT Bits -----------------------------------------------------
TBC24            EQU  H'0000'
TBC25            EQU  H'0001'
TBC26            EQU  H'0002'
TBC27            EQU  H'0003'
TBC28            EQU  H'0004'
TBC29            EQU  H'0005'
TBC30            EQU  H'0006'
TBC31            EQU  H'0007'


;----- C1TSCONL Bits -----------------------------------------------------
TBCPRE0          EQU  H'0000'
TBCPRE1          EQU  H'0001'
TBCPRE2          EQU  H'0002'
TBCPRE3          EQU  H'0003'
TBCPRE4          EQU  H'0004'
TBCPRE5          EQU  H'0005'
TBCPRE6          EQU  H'0006'
TBCPRE7          EQU  H'0007'


;----- C1TSCONH Bits -----------------------------------------------------
TBCPRE0          EQU  H'0000'
TBCPRE1          EQU  H'0001'
TBCPRE8          EQU  H'0000'
TBCPRE9          EQU  H'0001'


;----- C1TSCONU Bits -----------------------------------------------------
TBCEN            EQU  H'0000'
TSEOF            EQU  H'0001'
TSRES            EQU  H'0002'


;----- C1VECL Bits -----------------------------------------------------
ICODE0           EQU  H'0000'
ICODE1           EQU  H'0001'
ICODE2           EQU  H'0002'
ICODE3           EQU  H'0003'
ICODE4           EQU  H'0004'
ICODE5           EQU  H'0005'
ICODE6           EQU  H'0006'


;----- C1VECH Bits -----------------------------------------------------
FILHIT0          EQU  H'0000'
FILHIT1          EQU  H'0001'
FILHIT2          EQU  H'0002'
FILHIT3          EQU  H'0003'
FILHIT4          EQU  H'0004'


;----- C1VECU Bits -----------------------------------------------------
TXCODE0          EQU  H'0000'
TXCODE1          EQU  H'0001'
TXCODE2          EQU  H'0002'
TXCODE3          EQU  H'0003'
TXCODE4          EQU  H'0004'
TXCODE5          EQU  H'0005'
TXCODE6          EQU  H'0006'


;----- C1VECT Bits -----------------------------------------------------
RXCODE0          EQU  H'0000'
RXCODE1          EQU  H'0001'
RXCODE2          EQU  H'0002'
RXCODE3          EQU  H'0003'
RXCODE4          EQU  H'0004'
RXCODE5          EQU  H'0005'
RXCODE6          EQU  H'0006'


;----- C1INTL Bits -----------------------------------------------------
TXIF             EQU  H'0000'
RXIF             EQU  H'0001'
TBCIF            EQU  H'0002'
MODIF            EQU  H'0003'
TEFIF            EQU  H'0004'


;----- C1INTH Bits -----------------------------------------------------
TXATIF           EQU  H'0002'
RXOVIF           EQU  H'0003'
SERRIF           EQU  H'0004'
CERRIF           EQU  H'0005'
WAKIF            EQU  H'0006'
IVMIF            EQU  H'0007'


;----- C1INTU Bits -----------------------------------------------------
TXIE             EQU  H'0000'
RXIE             EQU  H'0001'
TBCIE            EQU  H'0002'
MODIE            EQU  H'0003'
TEFIE            EQU  H'0004'


;----- C1INTT Bits -----------------------------------------------------
TXATIE           EQU  H'0002'
RXOVIE           EQU  H'0003'
SERRIE           EQU  H'0004'
CERRIE           EQU  H'0005'
WAKIE            EQU  H'0006'
IVMIE            EQU  H'0007'


;----- C1RXIF Bits -----------------------------------------------------
RFIF0            EQU  H'0001'
RFIF1            EQU  H'0002'
RFIF2            EQU  H'0003'
RFIF3            EQU  H'0004'
RFIF4            EQU  H'0005'
RFIF5            EQU  H'0006'
RFIF6            EQU  H'0007'
RFIF1            EQU  H'0001'
RFIF2            EQU  H'0002'
RFIF3            EQU  H'0003'
RFIF4            EQU  H'0004'
RFIF5            EQU  H'0005'
RFIF6            EQU  H'0006'
RFIF7            EQU  H'0007'


;----- C1RXIFH Bits -----------------------------------------------------
RFIF8            EQU  H'0000'
RFIF9            EQU  H'0001'
RFIF10           EQU  H'0002'
RFIF11           EQU  H'0003'
RFIF12           EQU  H'0004'
RFIF13           EQU  H'0005'
RFIF14           EQU  H'0006'
RFIF15           EQU  H'0007'


;----- C1RXIFU Bits -----------------------------------------------------
RFIF16           EQU  H'0000'
RFIF17           EQU  H'0001'
RFIF18           EQU  H'0002'
RFIF19           EQU  H'0003'
RFIF20           EQU  H'0004'
RFIF21           EQU  H'0005'
RFIF22           EQU  H'0006'
RFIF23           EQU  H'0007'


;----- C1RXIFT Bits -----------------------------------------------------
RFIF24           EQU  H'0000'
RFIF25           EQU  H'0001'
RFIF26           EQU  H'0002'
RFIF27           EQU  H'0003'
RFIF28           EQU  H'0004'
RFIF29           EQU  H'0005'
RFIF30           EQU  H'0006'
RFIF31           EQU  H'0007'


;----- C1TXIF Bits -----------------------------------------------------
TFIF0            EQU  H'0000'
TFIF1            EQU  H'0001'
TFIF2            EQU  H'0002'
TFIF3            EQU  H'0003'
TFIF4            EQU  H'0004'
TFIF5            EQU  H'0005'
TFIF6            EQU  H'0006'
TFIF7            EQU  H'0007'


;----- C1TXIFH Bits -----------------------------------------------------
TFIF8            EQU  H'0000'
TFIF9            EQU  H'0001'
TFIF10           EQU  H'0002'
TFIF11           EQU  H'0003'
TFIF12           EQU  H'0004'
TFIF13           EQU  H'0005'
TFIF14           EQU  H'0006'
TFIF15           EQU  H'0007'


;----- C1TXIFU Bits -----------------------------------------------------
TFIF16           EQU  H'0000'
TFIF17           EQU  H'0001'
TFIF18           EQU  H'0002'
TFIF19           EQU  H'0003'
TFIF20           EQU  H'0004'
TFIF21           EQU  H'0005'
TFIF22           EQU  H'0006'
TFIF23           EQU  H'0007'


;----- C1TXIFT Bits -----------------------------------------------------
TFIF24           EQU  H'0000'
TFIF25           EQU  H'0001'
TFIF26           EQU  H'0002'
TFIF27           EQU  H'0003'
TFIF28           EQU  H'0004'
TFIF29           EQU  H'0005'
TFIF30           EQU  H'0006'
TFIF31           EQU  H'0007'


;----- C1RXOVIF Bits -----------------------------------------------------
RFOVIF0          EQU  H'0001'
RFOVIF1          EQU  H'0002'
RFOVIF2          EQU  H'0003'
RFOVIF3          EQU  H'0004'
RFOVIF4          EQU  H'0005'
RFOVIF5          EQU  H'0006'
RFOVIF6          EQU  H'0007'
RFOVIF1          EQU  H'0001'
RFOVIF2          EQU  H'0002'
RFOVIF3          EQU  H'0003'
RFOVIF4          EQU  H'0004'
RFOVIF5          EQU  H'0005'
RFOVIF6          EQU  H'0006'
RFOVIF7          EQU  H'0007'


;----- C1RXOVIFH Bits -----------------------------------------------------
RFOVIF8          EQU  H'0000'
RFOVIF9          EQU  H'0001'
RFOVIF10         EQU  H'0002'
RFOVIF11         EQU  H'0003'
RFOVIF12         EQU  H'0004'
RFOVIF13         EQU  H'0005'
RFOVIF14         EQU  H'0006'
RFOVIF15         EQU  H'0007'


