GreatCowBASIC/DATFileGenerator/incfiles/p18F56Q84.inc
;----- PWM4CLK Bits -----------------------------------------------------
CLK0             EQU  H'0000'
CLK1             EQU  H'0001'
CLK2             EQU  H'0002'
CLK3             EQU  H'0003'
CLK4             EQU  H'0004'
CLK5             EQU  H'0005'
CLK6             EQU  H'0006'
CLK7             EQU  H'0007'


;----- PWM4LDS Bits -----------------------------------------------------
LDS0             EQU  H'0000'
LDS1             EQU  H'0001'
LDS2             EQU  H'0002'
LDS3             EQU  H'0003'
LDS4             EQU  H'0004'
LDS5             EQU  H'0005'
LDS6             EQU  H'0006'
LDS7             EQU  H'0007'


;----- PWM4PR Bits -----------------------------------------------------


;----- PWM4PRH Bits -----------------------------------------------------


;----- PWM4CPRE Bits -----------------------------------------------------


;----- PWM4PIPOS Bits -----------------------------------------------------


;----- PWM4GIR Bits -----------------------------------------------------
S1P1IF           EQU  H'0000'
S1P2IF           EQU  H'0001'


;----- PWM4GIE Bits -----------------------------------------------------
S1P1IE           EQU  H'0000'
S1P2IE           EQU  H'0001'


;----- PWM4CON Bits -----------------------------------------------------
ERSNOW           EQU  H'0000'
ERSPOL           EQU  H'0001'
LD_PWM4CON       EQU  H'0002'
EN               EQU  H'0007'


;----- PWM4S1CFG Bits -----------------------------------------------------
MODE0            EQU  H'0000'
MODE1            EQU  H'0001'
MODE2            EQU  H'0002'
PPEN             EQU  H'0003'
POL1             EQU  H'0006'
POL2             EQU  H'0007'
MODE0            EQU  H'0000'
MODE1            EQU  H'0001'
MODE2            EQU  H'0002'


;----- PWM4S1P2 Bits -----------------------------------------------------


;----- PWM4S1P2H Bits -----------------------------------------------------


;----- PWMLOAD Bits -----------------------------------------------------
PWM1LD           EQU  H'0000'
PWM2LD           EQU  H'0001'
PWM3LD           EQU  H'0002'
PWM4LD           EQU  H'0003'


;----- PWMEN Bits -----------------------------------------------------
PWM1EN           EQU  H'0000'
PWM2EN           EQU  H'0001'
PWM3EN           EQU  H'0002'
PWM4EN           EQU  H'0003'


;----- PIE0 Bits -----------------------------------------------------
SWIE             EQU  H'0000'
HLVDIE           EQU  H'0001'
OSFIE            EQU  H'0002'
CSWIE            EQU  H'0003'
TU16AIE          EQU  H'0004'
CLC1IE           EQU  H'0005'
CANIE            EQU  H'0006'
IOCIE            EQU  H'0007'


;----- PIE2 Bits -----------------------------------------------------
ADTIE            EQU  H'0000'
ADCH2IE          EQU  H'0001'
ADCH3IE          EQU  H'0002'
ADCH4IE          EQU  H'0003'
DMA1SCNTIE       EQU  H'0004'
DMA1DCNTIE       EQU  H'0005'
DMA1ORIE         EQU  H'0006'
DMA1AIE          EQU  H'0007'
ADCH1IE          EQU  H'0000'


;----- PIE3 Bits -----------------------------------------------------
SPI1RXIE         EQU  H'0000'
SPI1TXIE         EQU  H'0001'
SPI1IE           EQU  H'0002'
TMR2IE           EQU  H'0003'
TMR1IE           EQU  H'0004'
TMR1GIE          EQU  H'0005'
CCP1IE           EQU  H'0006'
TMR0IE           EQU  H'0007'


;----- PIE4 Bits -----------------------------------------------------
U1RXIE           EQU  H'0000'
U1TXIE           EQU  H'0001'
U1EIE            EQU  H'0002'
U1IE             EQU  H'0003'
CANRXIE          EQU  H'0004'
CANTXIE          EQU  H'0005'
PWM1PIE          EQU  H'0006'
PWM1IE           EQU  H'0007'


;----- PIE5 Bits -----------------------------------------------------
SPI2RXIE         EQU  H'0000'
SPI2TXIE         EQU  H'0001'
SPI2IE           EQU  H'0002'
TU16BIE          EQU  H'0003'
TMR3IE           EQU  H'0004'
TMR3GIE          EQU  H'0005'
PWM2PIE          EQU  H'0006'
PWM2IE           EQU  H'0007'


;----- PIE6 Bits -----------------------------------------------------
INT1IE           EQU  H'0000'
CLC2IE           EQU  H'0001'
CWG1IE           EQU  H'0002'
NCO1IE           EQU  H'0003'
DMA2SCNTIE       EQU  H'0004'
DMA2DCNTIE       EQU  H'0005'
DMA2ORIE         EQU  H'0006'
DMA2AIE          EQU  H'0007'


;----- PIE7 Bits -----------------------------------------------------
I2C1RXIE         EQU  H'0000'
I2C1TXIE         EQU  H'0001'
I2C1IE           EQU  H'0002'
I2C1EIE          EQU  H'0003'
CLC3IE           EQU  H'0005'
PWM3PIE          EQU  H'0006'
PWM3IE           EQU  H'0007'


;----- PIE8 Bits -----------------------------------------------------
U2RXIE           EQU  H'0000'
U2TXIE           EQU  H'0001'
U2EIE            EQU  H'0002'
U2IE             EQU  H'0003'
TMR5IE           EQU  H'0004'
TMR5GIE          EQU  H'0005'
CCP2IE           EQU  H'0006'
SCANIE           EQU  H'0007'


;----- PIE9 Bits -----------------------------------------------------
U3RXIE           EQU  H'0000'
U3TXIE           EQU  H'0001'
U3EIE            EQU  H'0002'
U3IE             EQU  H'0003'
CLC4IE           EQU  H'0005'
PWM4PIE          EQU  H'0006'
PWM4IE           EQU  H'0007'


;----- PIE10 Bits -----------------------------------------------------
INT2IE           EQU  H'0000'
CLC5IE           EQU  H'0001'
CWG2IE           EQU  H'0002'
NCO2IE           EQU  H'0003'
DMA3SCNTIE       EQU  H'0004'
DMA3DCNTIE       EQU  H'0005'
DMA3ORIE         EQU  H'0006'
DMA3AIE          EQU  H'0007'


;----- PIE12 Bits -----------------------------------------------------
U4RXIE           EQU  H'0000'
U4TXIE           EQU  H'0001'
U4EIE            EQU  H'0002'
U4IE             EQU  H'0003'
DMA5SCNTIE       EQU  H'0004'
DMA5DCNTIE       EQU  H'0005'
DMA5ORIE         EQU  H'0006'
DMA5AIE          EQU  H'0007'


;----- PIE13 Bits -----------------------------------------------------
U5RXIE           EQU  H'0000'
U5TXIE           EQU  H'0001'
U5EIE            EQU  H'0002'
U5IE             EQU  H'0003'
DMA6SCNTIE       EQU  H'0004'
DMA6DCNTIE       EQU  H'0005'
DMA6ORIE         EQU  H'0006'
DMA6AIE          EQU  H'0007'


