GreatCowBASIC/DATFileGenerator/incfiles/p18F56Q84.inc
;----- PIE14 Bits -----------------------------------------------------
CLC7IE           EQU  H'0001'
C2IE             EQU  H'0002'
NCO3IE           EQU  H'0003'
DMA7SCNTIE       EQU  H'0004'
DMA7DCNTIE       EQU  H'0005'
DMA7ORIE         EQU  H'0006'
DMA7AIE          EQU  H'0007'


;----- PIE15 Bits -----------------------------------------------------
NVMIE            EQU  H'0000'
CLC8IE           EQU  H'0001'
CRCIE            EQU  H'0002'
TMR6IE           EQU  H'0003'
DMA8SCNTIE       EQU  H'0004'
DMA8DCNTIE       EQU  H'0005'
DMA8ORIE         EQU  H'0006'
DMA8AIE          EQU  H'0007'


;----- PIR0 Bits -----------------------------------------------------
SWIF             EQU  H'0000'
HLVDIF           EQU  H'0001'
OSFIF            EQU  H'0002'
CSWIF            EQU  H'0003'
TU16AIF          EQU  H'0004'
CLC1IF           EQU  H'0005'
CANIF            EQU  H'0006'
IOCIF            EQU  H'0007'


;----- PIR2 Bits -----------------------------------------------------
ADTIF            EQU  H'0000'
ADCH2IF          EQU  H'0001'
ADCH3IF          EQU  H'0002'
ADCH4IF          EQU  H'0003'
DMA1SCNTIF       EQU  H'0004'
DMA1DCNTIF       EQU  H'0005'
DMA1ORIF         EQU  H'0006'
DMA1AIF          EQU  H'0007'
ADCH1IF          EQU  H'0000'


;----- PIR3 Bits -----------------------------------------------------
SPI1RXIF         EQU  H'0000'
SPI1TXIF         EQU  H'0001'
SPI1IF           EQU  H'0002'
TMR2IF           EQU  H'0003'
TMR1IF           EQU  H'0004'
TMR1GIF          EQU  H'0005'
CCP1IF           EQU  H'0006'
TMR0IF           EQU  H'0007'


;----- PIR4 Bits -----------------------------------------------------
U1RXIF           EQU  H'0000'
U1TXIF           EQU  H'0001'
U1EIF            EQU  H'0002'
U1IF             EQU  H'0003'
CANRXIF          EQU  H'0004'
CANTXIF          EQU  H'0005'
PWM1PIF          EQU  H'0006'
PWM1IF           EQU  H'0007'


;----- PIR5 Bits -----------------------------------------------------
SPI2RXIF         EQU  H'0000'
SPI2TXIF         EQU  H'0001'
SPI2IF           EQU  H'0002'
TU16BIF          EQU  H'0003'
TMR3IF           EQU  H'0004'
TMR3GIF          EQU  H'0005'
PWM2PIF          EQU  H'0006'
PWM2IF           EQU  H'0007'


;----- PIR6 Bits -----------------------------------------------------
INT1IF           EQU  H'0000'
CLC2IF           EQU  H'0001'
CWG1IF           EQU  H'0002'
NCO1IF           EQU  H'0003'
DMA2SCNTIF       EQU  H'0004'
DMA2DCNTIF       EQU  H'0005'
DMA2ORIF         EQU  H'0006'
DMA2AIF          EQU  H'0007'


;----- PIR7 Bits -----------------------------------------------------
I2C1RXIF         EQU  H'0000'
I2C1TXIF         EQU  H'0001'
I2C1IF           EQU  H'0002'
I2C1EIF          EQU  H'0003'
CLC3IF           EQU  H'0005'
PWM3PIF          EQU  H'0006'
PWM3IF           EQU  H'0007'


;----- PIR8 Bits -----------------------------------------------------
U2RXIF           EQU  H'0000'
U2TXIF           EQU  H'0001'
U2EIF            EQU  H'0002'
U2IF             EQU  H'0003'
TMR5IF           EQU  H'0004'
TMR5GIF          EQU  H'0005'
CCP2IF           EQU  H'0006'
SCANIF           EQU  H'0007'


;----- PIR9 Bits -----------------------------------------------------
U3RXIF           EQU  H'0000'
U3TXIF           EQU  H'0001'
U3EIF            EQU  H'0002'
U3IF             EQU  H'0003'
CLC4IF           EQU  H'0005'
PWM4PIF          EQU  H'0006'
PWM4IF           EQU  H'0007'


;----- PIR10 Bits -----------------------------------------------------
INT2IF           EQU  H'0000'
CLC5IF           EQU  H'0001'
CWG2IF           EQU  H'0002'
NCO2IF           EQU  H'0003'
DMA3SCNTIF       EQU  H'0004'
DMA3DCNTIF       EQU  H'0005'
DMA3ORIF         EQU  H'0006'
DMA3AIF          EQU  H'0007'


;----- PIR12 Bits -----------------------------------------------------
U4RXIF           EQU  H'0000'
U4TXIF           EQU  H'0001'
U4EIF            EQU  H'0002'
U4IF             EQU  H'0003'
DMA5SCNTIF       EQU  H'0004'
DMA5DCNTIF       EQU  H'0005'
DMA5ORIF         EQU  H'0006'
DMA5AIF          EQU  H'0007'


;----- PIR13 Bits -----------------------------------------------------
U5RXIF           EQU  H'0000'
U5TXIF           EQU  H'0001'
U5EIF            EQU  H'0002'
U5IF             EQU  H'0003'
DMA6SCNTIF       EQU  H'0004'
DMA6DCNTIF       EQU  H'0005'
DMA6ORIF         EQU  H'0006'
DMA6AIF          EQU  H'0007'


;----- PIR14 Bits -----------------------------------------------------
CLC7IF           EQU  H'0001'
C2IF             EQU  H'0002'
NCO3IF           EQU  H'0003'
DMA7SCNTIF       EQU  H'0004'
DMA7DCNTIF       EQU  H'0005'
DMA7ORIF         EQU  H'0006'
DMA7AIF          EQU  H'0007'


;----- PIR15 Bits -----------------------------------------------------
NVMIF            EQU  H'0000'
CLC8IF           EQU  H'0001'
CRCIF            EQU  H'0002'
TMR6IF           EQU  H'0003'
DMA8SCNTIF       EQU  H'0004'
DMA8DCNTIF       EQU  H'0005'
DMA8ORIF         EQU  H'0006'
DMA8AIF          EQU  H'0007'


;----- LATA Bits -----------------------------------------------------
LATA0            EQU  H'0000'
LATA1            EQU  H'0001'
LATA2            EQU  H'0002'
LATA3            EQU  H'0003'
LATA4            EQU  H'0004'
LATA5            EQU  H'0005'
LATA6            EQU  H'0006'
LATA7            EQU  H'0007'


;----- LATB Bits -----------------------------------------------------
LATB0            EQU  H'0000'
LATB1            EQU  H'0001'
LATB2            EQU  H'0002'
LATB3            EQU  H'0003'
LATB4            EQU  H'0004'
LATB5            EQU  H'0005'
LATB6            EQU  H'0006'
LATB7            EQU  H'0007'


;----- LATC Bits -----------------------------------------------------
LATC0            EQU  H'0000'
LATC1            EQU  H'0001'
LATC2            EQU  H'0002'
LATC3            EQU  H'0003'
LATC4            EQU  H'0004'
LATC5            EQU  H'0005'
LATC6            EQU  H'0006'
LATC7            EQU  H'0007'


;----- LATD Bits -----------------------------------------------------
LATD0            EQU  H'0000'
LATD1            EQU  H'0001'
LATD2            EQU  H'0002'
LATD3            EQU  H'0003'
LATD4            EQU  H'0004'
LATD5            EQU  H'0005'
LATD6            EQU  H'0006'
LATD7            EQU  H'0007'


;----- LATE Bits -----------------------------------------------------
LATE0            EQU  H'0000'
LATE1            EQU  H'0001'
LATE2            EQU  H'0002'


;----- LATF Bits -----------------------------------------------------
LATF0            EQU  H'0000'
LATF1            EQU  H'0001'
LATF2            EQU  H'0002'
LATF3            EQU  H'0003'
LATF4            EQU  H'0004'
LATF5            EQU  H'0005'
LATF6            EQU  H'0006'
LATF7            EQU  H'0007'


;----- TRISA Bits -----------------------------------------------------
TRISA0           EQU  H'0000'
TRISA1           EQU  H'0001'
TRISA2           EQU  H'0002'
TRISA3           EQU  H'0003'
TRISA4           EQU  H'0004'
TRISA5           EQU  H'0005'
TRISA6           EQU  H'0006'
TRISA7           EQU  H'0007'


;----- TRISB Bits -----------------------------------------------------
TRISB0           EQU  H'0000'
TRISB1           EQU  H'0001'
TRISB2           EQU  H'0002'
TRISB3           EQU  H'0003'
TRISB4           EQU  H'0004'
TRISB5           EQU  H'0005'
TRISB6           EQU  H'0006'
TRISB7           EQU  H'0007'


